Функция ABS(Число) 
   Если Число<0 Тогда 
       Возврат -1*Число; 
   Иначе 
       Возврат Число; 
   КонецЕсли; 
КонецФункции 

Функция РастояниеВМетрахОтДо(Ширина1,Долгота1,Ширина2,Долгота2)
	Пи=3.14; РадиусЗ = 6372795; 
	Расстояние = РадиусЗ*ATAN(Sqrt(Pow(COS(Пи*Ширина2/180)*SIN(ABS(Пи*Долгота2/180-Пи*Долгота1/180)),2)+Pow(COS(Пи*Ширина1/180)*SIN(Пи*Ширина2/180)
		-SIN(Пи*Ширина1/180)*COS(Пи*Ширина2/180)*COS(ABS(Пи*Долгота2/180-Пи*Долгота1/180)),2))/(SIN(Пи*Ширина1/180)*SIN(Пи*Ширина2/180)+COS(Пи*Ширина1/180)
		*COS(Пи*Ширина2/180)*COS(ABS(Пи*Долгота2/180-Пи*Долгота1/180)))); 
	Расстояние = Окр((Расстояние/1000),2);	
	Возврат Расстояние;     
КонецФункции

&НаСервере
Процедура ПолучениеДоступныхАЗС()
	
	//Получаем емкость бензобака и берем гос номер авто, что бы в дальнейшем /////////////////////////////////////////////
	//с помощью запроса получить остатки по топливу для данного авто 
	Бензобак = Объект.Автомобиль.ЕмкостьБензобака;
	Госномер = Объект.Автомобиль.ГосНомер;
	
	//Получаем стартовые координаты точки отправления
	Широта1 = Объект.Автомобиль.СтоянкаАвто.КоордШирота;
	Долгота1 = Объект.Автомобиль.СтоянкаАвто.КоордДолгота;
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	// найдем актуальный расход топлива для данного авто используя запрос к БД ///////////////////////////////////////////
	Запрос = Новый Запрос;
    Запрос.Текст = 
	"ВЫБРАТЬ
	|   НормаРасходаГСМСрезПоследних.ЛКМ КАК ЛКМ,
	|   НормаРасходаГСМСрезПоследних.Автомобиль.Наименование КАК АвтомобильНаименование,
	|   НормаРасходаГСМСрезПоследних.Автомобиль.ГосНомер КАК АвтомобильГосНомер
    |ИЗ
	|   РегистрСведений.НормаРасходаГСМ.СрезПоследних КАК НормаРасходаГСМСрезПоследних";
	РезультатЗапроса = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Госномер =  ВыборкаДетальныеЗаписи.АвтомобильГосНомер Тогда 
			РасходТоплива = ВыборкаДетальныеЗаписи.ЛКМ;
		КонецЕсли;
	КонецЦикла;
	
	//Сообщить(РасходТоплива);
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	// при помощи запроса получаем остатки гсм ///////////////////////////////////////////////////////////////////////////    
    Запрос = Новый Запрос;
    Запрос.Текст = 
	"ВЫБРАТЬ
	|   ОстаткиГСМОстатки.Автомобиль.ГосНомер КАК АвтомобильГосНомер,
	|   ОстаткиГСМОстатки.КоличествоЛитровОстаток КАК КоличествоЛитровОстаток
	|ИЗ
	|   РегистрНакопления.ОстаткиГСМ.Остатки КАК ОстаткиГСМОстатки";
    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Госномер =  ВыборкаДетальныеЗаписи.АвтомобильГосНомер Тогда 
			ОстатокВбаке = ВыборкаДетальныеЗаписи.КоличествоЛитровОстаток;
		КонецЕсли;
	КонецЦикла;
	
	//Сообщить(ОстатокВбаке);
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	// расчет возможной дистанции для данного авто ///////////////////////////////////////////////////////////////////////
	ВозможныйПробег = Окр(((ОстатокВбаке/РасходТоплива)*100),2);
	
	//Сообщить(ВозможныйПробег);
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	// при помощи запроса получаем список АЗС, проходим циклом получаем расстояние до них ////////////////////////////////   
	// если позволяет пробег то указывем возможность для заезда на АЗС ///////////////////////////////////////////////////
	Запрос = Новый Запрос;
    Запрос.Текст = 
	"ВЫБРАТЬ
	|   ЦеныАЗССрезПоследних.АЗС КАК АЗС,
	|   ЦеныАЗССрезПоследних.ЦенаТоплива КАК ЦенаТоплива,
	|   ЦеныАЗССрезПоследних.АЗС.КоордШирота КАК АЗСКоордШирота,
	|   ЦеныАЗССрезПоследних.АЗС.КоордДолгота КАК АЗСКоордДолгота
	|ИЗ
	|   РегистрСведений.ЦеныАЗС.СрезПоследних КАК ЦеныАЗССрезПоследних";
    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РасстояниеДоАЗС = РастояниеВМетрахОтДо(Широта1, Долгота1, ВыборкаДетальныеЗаписи.АЗСКоордШирота, ВыборкаДетальныеЗаписи.АЗСКоордДолгота);
		
		Если ВозможныйПробег >= РасстояниеДоАЗС Тогда 
			Сообщить("Есть возможность заехать." + " Расстояние: " + РасстояниеДоАЗС + " км " + " до " + ВыборкаДетальныеЗаписи.АЗС);	
		Иначе
			Сообщить("Для заезда на данные АЗС не хватит ГСМ." + " Расстояние: " + РасстояниеДоАЗС + " км " + " до " + ВыборкаДетальныеЗаписи.АЗС);	
		КонецЕсли;
	КонецЦикла;
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	
	// получение расстояния до точек назначения по прямой от точки старта ////////////////////////////////////////////////
	// информирует возможность доехать до точки назначения с учетом остатков /////////////////////////////////////////////
	Для Каждого Строка Из Объект.Маршрут Цикл
		Широта2 = Строка.КоордШирота;
		Долгота2 = Строка.КоордДолгота;
		ДистанцияДоТН = РастояниеВМетрахОтДо(Широта1, Долгота1, Широта2, Долгота2);
		
		Если ВозможныйПробег >= ДистанцияДоТН Тогда 
			Сообщить("Можно доехать без дозаправки." + "Расстояние: " + ДистанцияДоТН + " км, " + " до точки назначения: " + Строка.ТочкаНазначения);
		Иначе
			Сообщить("Необходима заправка !" + "Расстояние: " + ДистанцияДоТН + " км, " + " до точки назначения: " + Строка.ТочкаНазначения);
		КонецЕсли;	
	КонецЦикла;
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
КонецПроцедуры	

&НаКлиенте
Процедура ДоступныеАЗС(Команда)
	ПолучениеДоступныхАЗС();		
КонецПроцедуры
