

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УчетРейсов
	Движения.УчетРейсов.Записывать = Истина;
	Для Каждого ТекСтрокаМаршрут Из Маршрут Цикл
		Движение = Движения.УчетРейсов.Добавить();
		Движение.Период = Дата;
		Движение.ТочкаНазначения = ТекСтрокаМаршрут.ТочкаНазначения;
		Движение.Автомобиль = Автомобиль;
		Движение.КоордШирота = ТекСтрокаМаршрут.КоордШирота;
		Движение.КоордДолгота = ТекСтрокаМаршрут.КоордДолгота;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
 